<script setup lang="ts">
</script>

<template>
  <ContentCard>
    <h2>简介</h2>
    <p>AES是一种 <b>对称加密算法</b> 。</p>
    <p>
      加密和解密使用同一个秘钥，秘钥生成和交换的过程比较慢。可以使用一个<b>无需保密</b>的 <b>初始化向量</b>（IV），来将加密随机化。
      在使用同一密钥的情况下，不可重复使用同一个IV。这样即使同样秘钥和明文，多次加密也能产生不同的密文。
    </p>
    <p>
      AES每次只能运算固定长度的数据。更长的数据需要分多组计算，不足的部分需要填充数据。不同的分组和填充方案，产生了多种<b>分组密码工作模式</b>。
    </p>
    <br>

    <h3>ECB</h3>
    <p>明文按密码块大小被分为数个块，对每个块进行独立加密。没有使用IV，相同的明文块会被加密成相同的密文块，因此<span class="danger">不安全</span>。</p>
    <br>

    <h3>CBC</h3>
    <p>
      第一个块使用初始化向量，后续每个明文块，先与前一个密文进行异或运算，再加密。<br>
      最为常用的工作模式。串行工作，不利于并行计算。
    </p>
    <br>

    <h3>CFB</h3>
    <p>
      加密时，第一个块使用初始化向量，后续先将前一段加密得到的密文再加密一次，然后与当前段的明文异或运算。<br>
      解密的过程用的也是AES加密，而不是解密。
    </p>
    <br>

    <h3>OFB</h3>
    <p>
      先用块加密器生成密钥流，然后将密钥流与明文流异或得到密文流。<br>
      虽然加密解密都依赖前一段数据，但是明文和密文只在最终异或过程使用，因此可以实现对初始化向量进行加密，最后并行讲明文和密文异或处理。
    </p>
    <br>

    <h3>CTR</h3>
    <p>
      以IV为基础，通过一定的递增规则，产生连续的不重复的密码流。加密和解密过程均可以进行并行处理。
    </p>
    <br>

    <h2>安全强度</h2>
    <table>
      <thead>
        <tr>
          <th>算法</th>
          <th>安全强度</th>
          <th>安全性</th>
        </tr>
      </thead>
      <tbody>
        <tr>
          <td>AES-128</td>
          <td>128</td>
          <td class="safe">
            安全
          </td>
        </tr>
        <tr>
          <td>AES-192</td>
          <td>192</td>
          <td class="safe">
            安全
          </td>
        </tr>
        <tr>
          <td>AES-256</td>
          <td>256</td>
          <td class="safe">
            安全
          </td>
        </tr>
      </tbody>
    </table>
  </ContentCard>
</template>

<style scoped>
</style>
